# 도수 분포표 - 범주형 중 명목형 자료 : gender, bloodtype
df <- read.csv("testdata/ex_studentlist.csv")
df #      name gender age grade absence bloodtype height weight
  # 1  김길동     남  23     3      유         O  175.3   68.2
  # 2  이미린     여  NA     2      무        AB  170.1   53.0
  # 3  홍길동     남  24     4      무         B  175.0   80.1
  # 4  공기밥     남  23     3      무        AB  182.1   85.7
  # 5  손세수     여  20     1      유         A  168.0   49.5
  # 6  박미희     여  21     2      무         O  162.0   52.0
  # 7  강가에     여  22     1      무         O  155.2   45.3
  # 8  이희수     여  23     1      무         A  176.9   55.0
  # 9  공기밥     남  23     3      무         B  178.5   64.2
  # 10 박치기     남  22     2      무         B  176.1   61.3
  # 11 신기해     남  24     4      유         O  167.1   62.0
  # 12 임동민     남  22     2      무        AB  188.0   75.8
  # 13 김민수     남  21     1      무         A  162.2   55.3
  # 14 이겨라     여  23     3      무         O  176.1   53.1
  # 15 김미진     여  22     2      무         B  178.2   65.2

# table() 함수로 분할표 작성
freq <- table(df$gender, df$bloodtype) # gender, blootype 빈도 수
freq #      A AB B O
     # 남 1  2 3 2
     # 여 2  1 1 3

freq <- table(df$bloodtype)
freq #  A AB  B  O 
     # 3  3  4  5 

# 상대도수
rfreq <- prop.table(freq)
rfreq #             A         AB          B          O
      # 남 0.06666667 0.13333333 0.20000000 0.13333333
      # 여 0.13333333 0.06666667 0.06666667 0.20000000

rtable <- rbind(freq, rfreq)
rtable #               A         AB          B         O
       # freq 3.00000000 3.00000000 4.00000000 5.0000000
       # 남   0.06666667 0.13333333 0.20000000 0.1333333
       # 여   0.13333333 0.06666667 0.06666667 0.2000000
rtable <- addmargins(rtable, margin=1) # 1 : 열 / 2 : 행행
rtable #               A         AB          B         O
       # freq 3.00000000 3.00000000 4.00000000 5.0000000
       # 남   0.06666667 0.13333333 0.20000000 0.1333333
       # 여   0.13333333 0.06666667 0.06666667 0.2000000
       # Sum  3.20000000 3.20000000 4.26666667 5.3333333
